Revit 2026 API
FabricationUtils Class
 General utility methods in the Autodesk Revit MEP product for fabrication.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.FabricationUtils
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class FabricationUtils
Public NotInheritable Class FabricationUtils
public ref class FabricationUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricationUtils = class end
The FabricationUtils type exposes the following members.
Methods
Name | Description
ExportToPCF
ValidateConnectivity |  Check if two connectors are valid to connect directly without couplings.
Top
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace